*/****START OF SPECIFICATIONS*****************************************
*                                                                    *
*  01* Macro Name: BBOAXPRM                                          *
*                                                                    *
*  01* Descriptive Name: WAS Optimized Adapters API parameter        *
*                        lists (for assembler callers)               *
*                                                                    *
*  02*  Acronym: BBOAXPRM                                            *
*                                                                    *
*  01* PROPRIETARY STATEMENT=                                        *
*                                                                    *
*  *******************************************************************
*  IBM Confidential
*  OCO Source Materials
*  5655-N02 Copyright IBM Corp. 2000, 2010
*  The source code for this program is not published or otherwise
*  divested of its trade secrets, irrespective of what has been
*  deposited with the U.S. Copyright Office.
*  Status = H28W800
*  *******************************************************************
*                                                                    *
*                                                                    *
*                                                                    *
*  01* COMPONENT: WAS z/OS Adapters                                  *
*                                                                    *
*  01* DSECT Names:                                                  *
*                                                                    *
*      Control block mappings :                                      *
*      BBOAXPRM  - API parameter list structures                     *
*                                                                    *
*  01* Eye-Catcher: none                                             *
*  02*  Offset:                                                      *
*  02*  Length:                                                      *
*                                                                    *
*  01* Storage Attributes:                                           *
*                                                                    *
*  01* Size: See assembler listing.                                  *
*                                                                    *
*  01* Created by: Optimized local adapter API and supporting func.  *
*                                                                    *
*  01* Pointed to by:                                                *
*                                                                    *
*  01* Serialization:                                                *
*                                                                    *
*  01* Function: Provide parameter list mappings for WAS z/OS opt    *
*                local adapters assembler and PL/X language          *
*                exploiters.                                         *
*                                                                    *
*  01* Method of Access:                                             *
*                                                                    *
*  02*  ASM: BBOAXPRM                                                *
*                                                                    *
*  02*  PL/X: %Include Syslib(BBOAXPRM)                              *
*                                                                    *
*  01* Notes:                                                        *
*                                                                    *
*  02*  Dependencies: None                                           *
*                                                                    *
*  01* Distribution Library:                                         *
*                                                                    *
*   EXTERNAL CLASSIFICATION: NONE                                    *
*   END OF EXTERNAL CLASSIFICATION                                   *
*                                                                    *
*                                                                    *
*  01* Change Activity:                                              *
*                                                                    *
*   Flag Reason  Release  YYYYMMDD  Origin  Description              *
*   -----------  -------  --------  ------  ------------------------ *
*                H28W700, 20080505,  JTM    Created for high speed   *
*                                           connectors LI4798/4799.  *
*   $OLAI5       H28W700, 20081222,  JTM    Add BBOA1GTX.            *
*   $LI4798I6-05 H28W700, 20090120,  JTM    Add BBOA1SRX.            *
*   LI4798I6-03  H28W700, 20090130   FGOL   Add time out to some APIs*
*   573317       H28W700, 20090203   FGOL   Fix BBG/BBO names        *
*   LI4798I7-11  H28W700, 20090221   JTM    Rework for TRUE updates. *
*   $LI4798I7-01,H28W700, 20090228,  FGOL   Add flag for security    *
*                                               propagation by task  *
*   578124       H28W700, 20090303,  JTM    BBOA1RCS bad extra parm. *
*   579234       H28W700, 20090310,  JTM    Add waittime to BBOA1RCA.*
*   $F003691-01  H28W700, 20090911, FGOL    Add reg trace level flags*
*   $F003703     H28W800, 20101026, PDFG    Fix BBOA1GET parm list   *
*   $F003703     H28W700,  20101130  FGOL   64-bit API support       *
*                                                                    *
******END OF SPECIFICATIONS******************************************/
*
         MACRO
         BBOAXPRM  ,
*
* **********************************************************
* WAS zOS Connector API parameter lists for external callers
* **********************************************************
*
* BBOA1REG Parameter List (31 bit)
*
BBOA1REG_PLIST DSECT ,
BBOA1REG_GROUP  DS  A          in    +000  Addr(Daemon group name)
BBOA1REG_NODE   DS  A          in    +004  Addr(Node name)
BBOA1REG_SERVER DS  A          in    +008  Addr(Server name)
BBOA1REG_REGNAME DS A          in    +00C  Addr(Register name)
BBOA1REG_MINCONN DS A          in    +010  Addr(Min Conns setting)
BBOA1REG_MAXCONN DS A          in    +014  Addr(Max Conns setting)
BBOA1REG_REGFLAGS DS A         in    +018  Addr(Register flags)
BBOA1REG_RC     DS  A          out   +01C  Addr(Return Code)
BBOA1REG_RSN    DS  A          out   +020  Addr(Reason Code)
BBOA1REG_PC1PRM DS  A          out   +024  Addr(PC1 prms) @LI4798I7-11A
*
* BBGA1REG Parameter List (64 bit)
*
BBGA1REG_PLIST DSECT ,
BBGA1REG_GROUP  DS  AD         in    +000  Addr(Daemon group name)
BBGA1REG_NODE   DS  AD         in    +008  Addr(Node name)
BBGA1REG_SERVER DS  AD         in    +010  Addr(Server name)
BBGA1REG_REGNAME DS AD         in    +018  Addr(Register name)
BBGA1REG_MINCONN DS AD         in    +020  Addr(Min Conns setting)
BBGA1REG_MAXCONN DS AD         in    +028  Addr(Max Conns setting)
BBGA1REG_REGFLAGS DS AD        in    +030  Addr(Register flags)
BBGA1REG_RC     DS  AD         out   +038  Addr(Return Code)
BBGA1REG_RSN    DS  AD         out   +040  Addr(Reason Code)
BBGA1REG_PC1PRM DS  AD         out   +048  Addr(PC1 prms) @LI4798I7-11A
*
*           REGFLAGS definition                         @LI4798I7-01A
reg_flag_trcmod    EQU X'80000000' modify trace level    @F003691-01A
reg_flag_trcmore   EQU X'40000000' trace level=2         @F003691-01A
reg_flag_trcsome   EQU X'20000000' trace level=1         @F003691-01A
reg_flag_C2Wprop   EQU X'00000004' Propgt task security @LI4798I7-01A
reg_flag_trans     EQU X'00000002' Transactional        @LI4798I7-01A
reg_flag_W2Cprop   EQU X'00000001' Assert WAS security  @LI4798I7-01A
*
* BBOA1URG Parameter List (31 bit)
*
BBOA1URG_PLIST DSECT ,
BBOA1URG_REGNAME DS  A         in    +000  Addr(Register name)
BBOA1URG_URGFLAGS DS  A        in    +004  Addr(Unregister flags)
BBOA1URG_RC      DS  A         out   +008  Addr(Return Code)
BBOA1URG_RSN     DS  A         out   +00C  Addr(Reason Code)
BBOA1URG_PC1PRM DS  A          out   +010  Addr(PC1 prms) @LI4798I7-11A
*
* BBOA1URG Parameter List (64 bit)
*
BBGA1URG_PLIST DSECT ,
BBGA1URG_REGNAME DS  AD        in    +000  Addr(Register name)
BBGA1URG_URGFLAGS DS AD        in    +008  Addr(Unregister flags)
BBGA1URG_RC      DS  AD        out   +010  Addr(Return Code)
BBGA1URG_RSN     DS  AD        out   +018  Addr(Reason Code)
BBGA1URG_PC1PRM DS  AD         out   +020  Addr(PC1 prms) @LI4798I7-11A
*
* BBOA1CNG Parameter List (31 bit)
*
BBOA1CNG_PLIST DSECT ,
BBOA1CNG_REGNAME DS A          in    +000  Addr(Register name)
BBOA1CNG_CONNHDL DS A          out   +004  Addr(Connection hdl)
BBOA1CNG_WAITTIME DS  A        in    +008  Addr(Wait time)
BBOA1CNG_RC     DS  A          out   +00C  Addr(Return Code)
BBOA1CNG_RSN    DS  A          out   +010  Addr(Reason Code)
BBOA1CNG_PC1PRM DS  A          out   +014  Addr(PC1 prms) @LI4798I7-11A
*
* BBGA1CNG Parameter List (64 bit)
*
BBGA1CNG_PLIST DSECT ,
BBGA1CNG_REGNAME DS AD         in    +000  Addr(Register name)
BBGA1CNG_CONNHDL DS AD         out   +008  Addr(Connection hdl)
BBGA1CNG_WAITTIME DS  AD       in    +010  Addr(Wait time)
BBGA1CNG_RC     DS  AD         out   +018  Addr(Return Code)
BBGA1CNG_RSN    DS  AD         out   +020  Addr(Reason Code)
BBGA1CNG_PC1PRM DS  AD         out   +028  Addr(PC1 prms) @LI4798I7-11A
*
* BBOA1CNR Parameter List (31 bit)
*
BBOA1CNR_PLIST DSECT ,
BBOA1CNR_CONNHDL DS A          in    +000  Addr(Connection hdl)
BBOA1CNR_RC     DS  A          out   +004  Addr(Return Code)
BBOA1CNR_RSN    DS  A          out   +008  Addr(Reason Code)
BBOA1CNR_PC1PRM DS  A          out   +00C  Addr(PC1 prms) @LI4798I7-11A
*
* BBGA1CNR Parameter List (64 bit)
*
BBGA1CNR_PLIST DSECT ,
BBGA1CNR_CONNHDL DS AD         in    +000  Addr(Connection hdl)
BBGA1CNR_RC     DS  AD         out   +008  Addr(Return Code)
BBGA1CNR_RSN    DS  AD         out   +010  Addr(Reason Code)
BBGA1CNR_PC1PRM DS  AD         out   +018  Addr(PC1 prms) @LI4798I7-11A
*
* BBOA1SRQ Parameter List (31 bit)
*
BBOA1SRQ_PLIST DSECT ,
BBOA1SRQ_CONNHDL DS A          in    +000  Addr(Connection hdl)
BBOA1SRQ_REQTYPE DS A          in    +004  Addr(Request type)
BBOA1SRQ_SERVNAME DS A         in    +008  Addr(Service name)
BBOA1SRQ_SERVNAMEL DS A        in    +00C  Addr(Service name len)
BBOA1SRQ_REQDATA DS A          in    +010  Addr(Request data)
BBOA1SRQ_REQDATAL DS A         in    +014  Addr(Request data len)
BBOA1SRQ_ASYNC  DS  A          in    +018  Addr(Async setting)
BBOA1SRQ_RSPDATAL DS A         in    +01C  Addr(Response data len)
BBOA1SRQ_RC     DS  A          out   +020  Addr(Return Code)
BBOA1SRQ_RSN    DS  A          out   +024  Addr(Reason Code)
BBOA1SRQ_PC1PRM DS  A          out   +028  Addr(PC1 prms) @LI4798I7-11A
*
* BBGA1SRQ Parameter List (64 bit)
*
BBGA1SRQ_PLIST DSECT ,
BBGA1SRQ_CONNHDL DS AD         in    +000  Addr(Connection hdl)
BBGA1SRQ_REQTYPE DS AD         in    +008  Addr(Request type)
BBGA1SRQ_SERVNAME DS AD        in    +010  Addr(Service name)
BBGA1SRQ_SERVNAMEL DS AD       in    +018  Addr(Service name len)
BBGA1SRQ_REQDATA DS AD         in    +020  Addr(Request data)
BBGA1SRQ_REQDATAL DS AD        in    +028  Addr(Request data len)
BBGA1SRQ_ASYNC  DS  AD         in    +030  Addr(Async setting)
BBGA1SRQ_RSPDATAL DS AD        in    +038  Addr(Response data len)
BBGA1SRQ_RC     DS  AD         out   +040  Addr(Return Code)
BBGA1SRQ_RSN    DS  AD         out   +048  Addr(Reason Code)
BBGA1SRQ_PC1PRM DS  AD         out   +050  Addr(PC1 prms) @LI4798I7-11A
*
* BBOA1SRP Parameter List (31 bit)
*
BBOA1SRP_PLIST DSECT ,
BBOA1SRP_CONNHDL DS A          in    +000  Addr(Connection hdl)
BBOA1SRP_RSPDATA DS A          in    +004  Addr(Response data)
BBOA1SRP_RSPDATAL DS A         in    +008  Addr(Response data len)
BBOA1SRP_RC     DS  A          out   +010  Addr(Return Code)
BBOA1SRP_RSN    DS  A          out   +014  Addr(Reason Code)
BBOA1SRP_PC1PRM DS  A          out   +018  Addr(PC1 prms) @LI4798I7-11A
*
* BBGA1SRP Parameter List (64 bit)
*
BBGA1SRP_PLIST DSECT ,
BBGA1SRP_CONNHDL DS AD         in    +000  Addr(Connection hdl)
BBGA1SRP_RSPDATA DS AD         in    +008  Addr(Response data)
BBGA1SRP_RSPDATAL DS AD        in    +010  Addr(Response data len)
BBGA1SRP_RC     DS  AD         out   +018  Addr(Return Code)
BBGA1SRP_RSN    DS  AD         out   +020  Addr(Reason Code)
BBGA1SRP_PC1PRM DS  AD         out   +028  Addr(PC1 prms) @LI4798I7-11A
*
* BBOA1SRX Parameter List (31 bit)
*
BBOA1SRX_PLIST DSECT ,
BBOA1SRX_CONNHDL DS A          in    +000  Addr(Connection hdl)
BBOA1SRX_RSPDATA DS A          in    +004  Addr(Response exc. data)
BBOA1SRX_RSPDATAL DS A         in    +008  Addr(Response exc. data len)
BBOA1SRX_RC     DS  A          out   +010  Addr(Return Code)
BBOA1SRX_RSN    DS  A          out   +014  Addr(Reason Code)
BBOA1SRX_PC1PRM DS  A          out   +018  Addr(PC1 prms) @LI4798I7-11A
*
* BBGA1SRX Parameter List (64 bit)
*
BBGA1SRX_PLIST DSECT ,
BBGA1SRX_CONNHDL DS AD         in    +000  Addr(Connection hdl)
BBGA1SRX_RSPDATA DS AD         in    +008  Addr(Response exc. data)
BBGA1SRX_RSPDATAL DS AD        in    +010  Addr(Response exc. data len)
BBGA1SRX_RC     DS  AD         out   +018  Addr(Return Code)
BBGA1SRX_RSN    DS  AD         out   +020  Addr(Reason Code)
BBGA1SRX_PC1PRM DS  AD         out   +028  Addr(PC1 prms) @LI4798I7-11A
*
* BBOA1RCA Parameter List (31 bit)
*
BBOA1RCA_PLIST DSECT ,
BBOA1RCA_REGNAME DS A          in    +000  Addr(Register name)
BBOA1RCA_CONNHDL DS A          out   +004  Addr(Connection hdl)
BBOA1RCA_SERVNAME DS A         in    +008  Addr(Service name)
BBOA1RCA_SERVNAMEL DS A        in    +00C  Addr(Service name len)
BBOA1RCA_REQDATAL DS A         in    +010  Addr(Request data len)
BBOA1RCA_WAITTIME DS  A        in    +014  Addr(Wait time) @579234A
BBOA1RCA_RC     DS  A          out   +018  Addr(Return Code)
BBOA1RCA_RSN    DS  A          out   +01C  Addr(Reason Code)
BBOA1RCA_PC1PRM DS  A          out   +020  Addr(PC1 prms) @LI4798I7-11A
*
* BBGA1RCA Parameter List (64 bit)
*
BBGA1RCA_PLIST DSECT ,
BBGA1RCA_REGNAME DS AD         in    +000  Addr(Register name)
BBGA1RCA_CONNHDL DS AD         out   +008  Addr(Connection hdl)
BBGA1RCA_SERVNAME DS AD        in    +010  Addr(Service name)
BBGA1RCA_SERVNAMEL DS AD       in    +018  Addr(Service name len)
BBGA1RCA_REQDATAL DS AD        in    +020  Addr(Request data len)
BBGA1RCA_WAITTIME DS  AD       in    +028  Addr(Wait time) @579234A
BBGA1RCA_RC     DS  AD         out   +030  Addr(Return Code)
BBGA1RCA_RSN    DS  AD         out   +038  Addr(Reason Code)
BBGA1RCA_PC1PRM DS  AD         out   +040  Addr(PC1 prms) @LI4798I7-11A
*
* BBOA1RCS Parameter List (31 bit)
*
BBOA1RCS_PLIST DSECT ,
BBOA1RCS_CONNHDL DS A          in    +000  Addr(Connection hdl)
BBOA1RCS_SERVNAME DS A         in    +008  Addr(Service name)
BBOA1RCS_SERVNAMEL DS A        in    +004  Addr(Service name len)
BBOA1RCS_REQDATAL DS A         in    +00C  Addr(Request data len)
BBOA1RCS_ASYNC  DS A           in    +010  Addr(Async setting)
BBOA1RCS_RC     DS A           out   +014  Addr(Return Code)
BBOA1RCS_RSN    DS A           out   +018  Addr(Reason Code)
BBOA1RCS_PC1PRM DS  A          out   +01C  Addr(PC1 prms) @LI4798I7-11A
*
* BBGA1RCS Parameter List (64 bit)
*
BBGA1RCS_PLIST DSECT ,
BBGA1RCS_CONNHDL DS AD         in    +000  Addr(Connection hdl)
BBGA1RCS_SERVNAME DS AD        in    +008  Addr(Service name)
BBGA1RCS_SERVNAMEL DS AD       in    +010  Addr(Service name len)
BBGA1RCS_REQDATAL DS AD        in    +018  Addr(Request data len)
BBGA1RCS_ASYNC  DS AD          in    +020  Addr(Async setting)
BBGA1RCS_RC     DS AD          out   +028  Addr(Return Code)
BBGA1RCS_RSN    DS AD          out   +030  Addr(Reason Code)
BBGA1RCS_PC1PRM DS AD          out   +038  Addr(PC1 prms) @LI4798I7-11A
*
* BBOA1RCL Parameter List (31 bit)
*
BBOA1RCL_PLIST DSECT ,
BBOA1RCL_CONNHDL DS A          in    +000  Addr(Connection hdl)
BBOA1RCL_ASYNC  DS A           in    +004  Addr(Async setting)
BBOA1RCL_RSPDATAL DS A         in    +008  Addr(Response data len)
BBOA1RCL_RC     DS A           out   +00C  Addr(Return Code)
BBOA1RCL_RSN    DS A           out   +010  Addr(Reason Code)
BBOA1RCL_PC1PRM DS  A          out   +014  Addr(PC1 prms) @LI4798I7-11A
*
* BBOA1RCL Parameter List (64 bit)
*
BBGA1RCL_PLIST DSECT ,
BBGA1RCL_CONNHDL DS AD         in    +000  Addr(Connection hdl)
BBGA1RCL_ASYNC  DS AD          in    +008  Addr(Async setting)
BBGA1RCL_RSPDATAL DS AD        in    +010  Addr(Response data len)
BBGA1RCL_RC     DS AD          out   +018  Addr(Return Code)
BBGA1RCL_RSN    DS AD          out   +020  Addr(Reason Code)  @F003703C
BBGA1RCL_PC1PRM DS AD          out   +028  Addr(PC1 prms) @LI4798I7-11A
*
* BBOA1GET Parameter List (31 bit)
*
BBOA1GET_PLIST DSECT ,
BBOA1GET_CONNHDL DS A          in    +000  Addr(Connection hdl)
BBOA1GET_MSGDATA DS A          in    +004  Addr(Msg outarea)
BBOA1GET_MSGDATAL DS A         in    +008  Addr(Length msg outarea)
BBOA1GET_RC     DS A           out   +00C  Addr(Return Code)
BBOA1GET_RSN    DS A           out   +010  Addr(Reason Code)
BBOA1GET_RVAL   DS A           out   +014  Addr(Return Value)
BBOA1GET_PC1PRM DS  A          out   +018  Addr(PC1 prms) @LI4798I7-11A
*
* BBGA1GET Parameter List (64 bit)
*
BBGA1GET_PLIST DSECT ,
BBGA1GET_CONNHDL DS AD         in    +000  Addr(Connection hdl)
BBGA1GET_MSGDATA DS AD         in    +008  Addr(Msg outarea)
BBGA1GET_MSGDATAL DS AD        in    +010  Addr(Length msg outarea)
BBGA1GET_RC     DS AD          out   +018  Addr(Return Code)
BBGA1GET_RSN    DS AD          out   +020  Addr(Reason Code)
BBGA1GET_RVAL   DS AD          out   +028  Addr(Return Value)
BBGA1GET_PC1PRM DS  AD         out   +030  Addr(PC1 prms) @LI4798I7-11A
*
* BBOA1INV Parameter List (31 bit)
*
BBOA1INV_PLIST DSECT ,
BBOA1INV_REGNAME DS A          in    +000  Addr(Register name)
BBOA1INV_REQTYPE DS A          in    +004  Addr(Request type)
BBOA1INV_SERVNAME DS A         in    +00C  Addr(Service name)
BBOA1INV_SERVNAMEL DS A        in    +008  Addr(Service name len)
BBOA1INV_REQDATA DS A          in    +010  Addr(Request data)
BBOA1INV_REQDATAL DS A         in    +014  Addr(Request data len)
BBOA1INV_RSPDATA DS A          in    +018  Addr(Response data)
BBOA1INV_RSPDATAL DS A         in    +01C  Addr(Response data len)
BBOA1INV_WAITTIME@ DS  A       in    +020  Addr(Wait) @573317C
BBOA1INV_RC     DS  A          out   +024  Addr(Return Code)
BBOA1INV_RSN    DS  A          out   +028  Addr(Reason Code)
BBOA1INV_RVAL   DS  A          out   +02C  Addr(Return Value)
BBOA1INV_PC1PRM DS  A          out   +030  Addr(PC1 prms) @LI4798I7-11A
*
* BBGA1INV Parameter List (64 bit)
*
BBGA1INV_PLIST DSECT ,
BBGA1INV_REGNAME DS AD         in    +000  Addr(Register name)
BBGA1INV_REQTYPE DS AD         in    +008  Addr(Request type)
BBGA1INV_SERVNAME DS AD        in    +010  Addr(Service name)
BBGA1INV_SERVNAMEL DS AD       in    +018  Addr(Service name len)
BBGA1INV_REQDATA DS AD         in    +020  Addr(Request data)
BBGA1INV_REQDATAL DS AD        in    +028  Addr(Request data len)
BBGA1INV_RSPDATA DS AD         in    +030  Addr(Response data)
BBGA1INV_RSPDATAL DS AD        in    +038  Addr(Response data len)
BBGA1INV_WAITTIME@ DS  AD      in    +040  Addr(Wait) @LI4798I6-03A
BBGA1INV_RC     DS  AD         out   +048  Addr(Return Code)
BBGA1INV_RSN    DS  AD         out   +050  Addr(Reason Code)
BBGA1INV_RVAL   DS  AD         out   +058  Addr(Return Value)
BBGA1INV_PC1PRM DS  AD         out   +060  Addr(PC1 prms) @LI4798I7-11A
*
* BBOA1SRV Parameter List (31 bit)
*
BBOA1SRV_PLIST DSECT ,
BBOA1SRV_REGNAME DS A          in    +000  Addr(Register name)
BBOA1SRV_SERVNAME DS A         in    +004  Addr(Service name)
BBOA1SRV_SERVNAMEL DS A        in    +008  Addr(Service name len)
BBOA1SRV_REQDATA DS A          in    +00C  Addr(Request data)
BBOA1SRV_REQDATAL DS A         in    +010  Addr(Request data len)
BBOA1SRV_CONNHDL DS A          in    +014  Addr(Connection hdl)
BBOA1SRV_WAITTIME@ DS  A       in    +018  Addr(Wait) @573317C
BBOA1SRV_RC     DS  A          out   +01C  Addr(Return Code)
BBOA1SRV_RSN    DS  A          out   +020  Addr(Reason Code)
BBOA1SRV_RVAL   DS  A          out   +024  Addr(Return Value)
BBOA1SRV_PC1PRM DS  A          out   +028  Addr(PC1 prms) @LI4798I7-11A
*
* BBGA1SRV Parameter List (64 bit)
*
BBGA1SRV_PLIST DSECT ,
BBGA1SRV_REGNAME DS AD         in    +000  Addr(Register name)
BBGA1SRV_SERVNAME DS AD        in    +008  Addr(Service name)
BBGA1SRV_SERVNAMEL DS AD       in    +010  Addr(Service name len)
BBGA1SRV_REQDATA DS AD         in    +018  Addr(Request data)
BBGA1SRV_REQDATAL DS AD        in    +020  Addr(Request data len)
BBGA1SRV_CONNHDL DS AD         in    +028  Addr(Connection hdl)
BBGA1SRV_WAITTIME@ DS  AD      in    +030  Addr(Wait) @LI4798I6-03A
BBGA1SRV_RC     DS  AD         out   +038  Addr(Return Code)
BBGA1SRV_RSN    DS  AD         out   +040  Addr(Reason Code)
BBGA1SRV_RVAL   DS  AD         out   +048  Addr(Return Value)
BBGA1SRV_PC1PRM DS  AD         out   +050  Addr(PC1 prms) @LI4798I7-11A
*
* BBOA1INF Parameter List (31 bit)
*
BBOA1INF_PLIST DSECT ,
BBOA1INF_REGNAME DS A          in    +000  Addr(Register name)
BBOA1INF_GROUP  DS  A          out   +004  Addr(Daemon group name)
BBOA1INF_NODE   DS  A          out   +008  Addr(Node name)
BBOA1INF_SERVER DS  A          out   +00C  Addr(Server name)
BBOA1INF_ASHR@ DS A            out   +010  Addr(Ptr64 to BBOASHR)
BBOA1INF_ATRACE@ DS  A         out   +014  Addr(Ptr64 to BBOATRAH)
BBOA1INF_ARGE@ DS  A           out   +018  Addr(Ptr64 to BBOARGE)
BBOA1INF_CONNDATA@ DS  A       in    +01C  Addr(BBOACONN)
BBOA1INF_RC     DS  A          out   +020  Addr(Return Code)
BBOA1INF_RSN    DS  A          out   +024  Addr(Reason Code)
BBOA1INF_PC1PRM DS  A          out   +028  Addr(PC1 prms) @LI4798I7-11A
*
* BBGA1INF Parameter List (64 bit)
*
BBGA1INF_PLIST DSECT ,
BBGA1INF_REGNAME DS AD         in    +000  Addr(Register name)
BBGA1INF_GROUP  DS  AD         out   +008  Addr(Daemon group name)
BBGA1INF_NODE   DS  AD         out   +010  Addr(Node name)
BBGA1INF_SERVER DS  AD         out   +018  Addr(Server name)
BBGA1INF_ASHR@ DS AD           out   +020  Addr(Ptr64 to BBOASHR)
BBGA1INF_ATRACE@ DS  AD        out   +028  Addr(Ptr64 to BBOATRAH)
BBGA1INF_ARGE@ DS  AD          out   +030  Addr(Ptr64 to BBOARGE)
BBGA1INF_CONNDATA@ DS  AD      in    +038  Addr(BBOACONN)
BBGA1INF_RC     DS  AD         out   +040  Addr(Return Code)
BBGA1INF_RSN    DS  AD         out   +048  Addr(Reason Code)
BBGA1INF_PC1PRM DS  AD         out   +050  Addr(PC1 prms) @LI4798I7-11A
*
*
* BBOA1GTX Parameter List (31 bit)
*
BBOA1GTX_PLIST DSECT ,
BBOA1GTX_CONNHDL DS A          in    +000  Addr(Connection hdl)
BBOA1GTX_CTXTDATA DS A         in    +004  Addr(Context data)
BBOA1GTX_CTXTLEN DS A          in    +008  Addr(Context length)
BBOA1GTX_RC     DS  A          out   +00C  Addr(Return Code)
BBOA1GTX_RSN    DS  A          out   +010  Addr(Reason Code)
BBOA1GTX_RV     DS  A          out   +014  Addr(Return Value)
BBOA1GTX_PC1PRM DS  A          out   +018  Addr(PC1 prms) @LI4798I7-11A
*
* BBGA1GTX Parameter List (64 bit)
*
BBGA1GTX_PLIST DSECT ,
BBGA1GTX_CONNHDL DS AD         in    +000  Addr(Connection hdl)
BBGA1GTX_CTXTDATA DS AD        in    +008  Addr(Context data)
BBGA1GTX_CTXTLEN DS AD         in    +010  Addr(Context length)
BBGA1GTX_RC     DS  AD         out   +018  Addr(Return Code)
BBGA1GTX_RSN    DS  AD         out   +020  Addr(Reason Code)
BBGA1GTX_RV     DS  AD         out   +028  Addr(Return Value)
BBGA1GTX_PC1PRM DS  AD         out   +030  Addr(PC1 prms) @LI4798I7-11A
*
* ------------------------------------------------------------------
* These are the parameter lists to the functions in
* client_wola_stubs.mc.  They are 64-bit only.  Called from
* bboasXXX.s and bboatrux.cicsasm
* ------------------------------------------------------------------
*
WOLA_CLIENT_REGISTER_PARMS DSECT ,
WOLA_CLIENT_REGISTER_GROUP    DS AD in  +000  Addr(WOLA group name)
WOLA_CLIENT_REGISTER_WOLA2    DS AD in  +008  Addr(WOLA name part 2)
WOLA_CLIENT_REGISTER_WOLA3    DS AD in  +010  Addr(WOLA name part 3)
WOLA_CLIENT_REGISTER_NAME     DS AD in  +018  Addr(Register name)
WOLA_CLIENT_REGISTER_MINCONN  DS AD in  +020  Addr(Min Conns setting)
WOLA_CLIENT_REGISTER_MAXCONN  DS AD in  +028  Addr(Max Conns setting)
WOLA_CLIENT_REGISTER_FLAGS    DS AD in  +030  Addr(Register flags)
WOLA_CLIENT_REGISTER_CICSPRM  DS AD in  +038  Addr(CICS parms)
WOLA_CLIENT_REGISTER_RC       DS AD out +040  Addr(Return Code)
WOLA_CLIENT_REGISTER_RSN      DS AD out +048  Addr(Reason Code)
*
WOLA_CLIENT_UNREGISTER_PARMS DSECT ,
WOLA_CLIENT_UNREGISTER_NAME  DS  AD  in  +000  Addr(Register name)
WOLA_CLIENT_UNREGISTER_FLAGS DS  AD  in  +008  Addr(Unregister flags)
WOLA_CLIENT_UNREGISTER_CICSPRM DS AD in  +010  Addr(CICS parms)
WOLA_CLIENT_UNREGISTER_RC    DS  AD  out +018  Addr(Return Code)
WOLA_CLIENT_UNREGISTER_RSN   DS  AD  out +020  Addr(Reason Code)
*
WOLA_CLIENT_CONNGET_PARMS DSECT ,
WOLA_CLIENT_CONNGET_NAME     DS AD in    +000  Addr(Register name)
WOLA_CLIENT_CONNGET_HANDLE   DS AD out   +008  Addr(Connection hdl)
WOLA_CLIENT_CONNGET_WAITTIME DS AD in    +010  Addr(Wait time)
WOLA_CLIENT_CONNGET_CICSPRM  DS AD in    +018  Addr(CICS parms)
WOLA_CLIENT_CONNGET_RC       DS AD out   +020  Addr(Return Code)
WOLA_CLIENT_CONNGET_RSN      DS AD out   +028  Addr(Reason Code)
*
WOLA_CLIENT_CONNREL_PARMS DSECT ,
WOLA_CLIENT_CONNREL_HANDLE   DS AD in    +000  Addr(Connection hdl)
WOLA_CLIENT_CONNREL_CICSPRM  DS AD in    +008  Addr(CICS parms)
WOLA_CLIENT_CONNREL_RC       DS AD out   +010  Addr(Return Code)
WOLA_CLIENT_CONNREL_RSN      DS AD out   +018  Addr(Reason Code)
*
WOLA_CLIENT_SENDREQ_PARMS DSECT ,
WOLA_CLIENT_SENDREQ_HANDLE    DS AD in  +000  Addr(Connection hdl)
WOLA_CLIENT_SENDREQ_REQTYPE   DS AD in  +008  Addr(Request type)
WOLA_CLIENT_SENDREQ_SERVNAME  DS AD in  +010  Addr(Service name)
WOLA_CLIENT_SENDREQ_SERVNAMEL DS AD in  +018  Addr(Service name len)
WOLA_CLIENT_SENDREQ_REQDATA   DS AD in  +020  Addr(Request data)
WOLA_CLIENT_SENDREQ_REQDATAL  DS AD in  +028  Addr(Request data len)
WOLA_CLIENT_SENDREQ_ASYNC     DS AD in  +030  Addr(Async setting)
WOLA_CLIENT_SENDREQ_RSPDATAL  DS AD in  +038  Addr(Response data len)
WOLA_CLIENT_SENDREQ_CICSPRM   DS AD in  +040  Addr(CICS parms)
WOLA_CLIENT_SENDREQ_RC        DS AD out +048  Addr(Return Code)
WOLA_CLIENT_SENDREQ_RSN       DS AD out +050  Addr(Reason Code)
*
WOLA_CLIENT_SENDRESP_PARMS DSECT ,
WOLA_CLIENT_SENDRESP_HANDLE   DS AD in  +000  Addr(Connection hdl)
WOLA_CLIENT_SENDRESP_DATA     DS AD in  +008  Addr(Response data)
WOLA_CLIENT_SENDRESP_DATAL    DS AD in  +010  Addr(Response data len)
WOLA_CLIENT_SENDRESP_CICSPRM  DS AD in  +018  Addr(CICS parms)
WOLA_CLIENT_SENDRESP_RC       DS AD out +020  Addr(Return Code)
WOLA_CLIENT_SENDRESP_RSN      DS AD out +028  Addr(Reason Code)
*
WOLA_CLIENT_SENDEXCP_PARMS DSECT ,
WOLA_CLIENT_SENDEXCP_HANDLE   DS AD in  +000  Addr(Connection hdl)
WOLA_CLIENT_SENDEXCP_DATA     DS AD in  +008  Addr(Response exc. data)
WOLA_CLIENT_SENDEXCP_DATAL    DS AD in  +010  Addr(Resp exc. data len)
WOLA_CLIENT_SENDEXCP_CICSPRM  DS AD in  +018  Addr(CICS parms)
WOLA_CLIENT_SENDEXCP_RC       DS AD out +020  Addr(Return Code)
WOLA_CLIENT_SENDEXCP_RSN      DS AD out +028  Addr(Reason Code)
*
WOLA_CLIENT_RECVANY_PARMS DSECT ,
WOLA_CLIENT_RECVANY_REGNAME   DS AD in  +000  Addr(Register name)
WOLA_CLIENT_RECVANY_HANDLE    DS AD out +008  Addr(Connection hdl)
WOLA_CLIENT_RECVANY_SERVNAME  DS AD in  +010  Addr(Service name)
WOLA_CLIENT_RECVANY_SERVNAMEL DS AD in  +018  Addr(Service name len)
WOLA_CLIENT_RECVANY_DATAL     DS AD in  +020  Addr(Request data len)
WOLA_CLIENT_RECVANY_WAITTIME  DS AD in  +028  Addr(Wait time)
WOLA_CLIENT_RECVANY_CICSPRM   DS AD in  +030  Addr(CICS parms)
WOLA_CLIENT_RECVANY_RC        DS AD out +038  Addr(Return Code)
WOLA_CLIENT_RECVANY_RSN       DS AD out +040  Addr(Reason Code)
*
WOLA_CLIENT_RECVSPC_PARMS DSECT ,
WOLA_CLIENT_RECVSPC_HANDLE    DS AD in  +000  Addr(Connection hdl)
WOLA_CLIENT_RECVSPC_SERVNAME  DS AD in  +008  Addr(Service name)
WOLA_CLIENT_RECVSPC_SERVNAMEL DS AD in  +010  Addr(Service name len)
WOLA_CLIENT_RECVSPC_DATAL     DS AD in  +018  Addr(Request data len)
WOLA_CLIENT_RECVSPC_ASYNC     DS AD in  +020  Addr(Async setting)
WOLA_CLIENT_RECVSPC_CICSPRM   DS AD in  +028  Addr(CICS parms)
WOLA_CLIENT_RECVSPC_RC        DS AD out +030  Addr(Return Code)
WOLA_CLIENT_RECVSPC_RSN       DS AD out +038  Addr(Reason Code)
*
WOLA_CLIENT_RECVLEN_PARMS DSECT ,
WOLA_CLIENT_RECVLEN_HANDLE    DS AD in  +000  Addr(Connection hdl)
WOLA_CLIENT_RECVLEN_ASYNC     DS AD in  +008  Addr(Async setting)
WOLA_CLIENT_RECVLEN_RSPDATAL  DS AD in  +010  Addr(Response data len)
WOLA_CLIENT_RECVLEN_CICSPRM   DS AD in  +018  Addr(CICS parms)
WOLA_CLIENT_RECVLEN_RC        DS AD out +020  Addr(Return Code)
WOLA_CLIENT_RECVLEN_RSN       DS AD out +028  Addr(Reason Code)
*
WOLA_CLIENT_GETDATA_PARMS DSECT ,
WOLA_CLIENT_GETDATA_HANDLE    DS AD in  +000  Addr(Connection hdl)
WOLA_CLIENT_GETDATA_DATA      DS AD in  +008  Addr(Msg outarea)
WOLA_CLIENT_GETDATA_DATAL     DS AD in  +010  Addr(Length msg outarea)
WOLA_CLIENT_GETDATA_CICSPRM   DS AD in  +018  Addr(CICS parms)
WOLA_CLIENT_GETDATA_RC        DS AD out +020  Addr(Return Code)
WOLA_CLIENT_GETDATA_RSN       DS AD out +028  Addr(Reason Code)
WOLA_CLIENT_GETDATA_RV        DS AD out +030  Addr(Return Value)
*
WOLA_CLIENT_INVOKE_PARMS DSECT ,
WOLA_CLIENT_INVOKE_REGNAME    DS AD in  +000  Addr(Register name)
WOLA_CLIENT_INVOKE_REQTYPE    DS AD in  +008  Addr(Request type)
WOLA_CLIENT_INVOKE_SERVNAME   DS AD in  +010  Addr(Service name)
WOLA_CLIENT_INVOKE_SERVNAMEL  DS AD in  +018  Addr(Service name len)
WOLA_CLIENT_INVOKE_REQDATA    DS AD in  +020  Addr(Request data)
WOLA_CLIENT_INVOKE_REQDATAL   DS AD in  +028  Addr(Request data len)
WOLA_CLIENT_INVOKE_RSPDATA    DS AD in  +030  Addr(Response data)
WOLA_CLIENT_INVOKE_RSPDATAL   DS AD in  +038  Addr(Response data len)
WOLA_CLIENT_INVOKE_WAITTIME   DS AD in  +040  Addr(Conn Waittime)
WOLA_CLIENT_INVOKE_CICSPRM    DS AD in  +048  Addr(CICS parms)
WOLA_CLIENT_INVOKE_RC         DS AD out +050  Addr(Return Code)
WOLA_CLIENT_INVOKE_RSN        DS AD out +058  Addr(Reason Code)
WOLA_CLIENT_INVOKE_RV         DS AD out +060  Addr(Return Value)
*
WOLA_CLIENT_HOST_PARMS DSECT ,
WOLA_CLIENT_HOST_REGNAME      DS AD in  +000  Addr(Register name)
WOLA_CLIENT_HOST_SERVNAME     DS AD in  +008  Addr(Service name)
WOLA_CLIENT_HOST_SERVNAMEL    DS AD in  +010  Addr(Service name len)
WOLA_CLIENT_HOST_REQDATA      DS AD in  +018  Addr(Request data)
WOLA_CLIENT_HOST_REQDATAL     DS AD in  +020  Addr(Request data len)
WOLA_CLIENT_HOST_HANDLE       DS AD in  +028  Addr(Connection hdl)
WOLA_CLIENT_HOST_WAITTIME     DS AD in  +030  Addr(Wait)
WOLA_CLIENT_HOST_CICSPRM      DS AD in  +038  Addr(CICS parms)
WOLA_CLIENT_HOST_RC           DS AD out +040  Addr(Return Code)
WOLA_CLIENT_HOST_RSN          DS AD out +048  Addr(Reason Code)
WOLA_CLIENT_HOST_RV           DS AD out +050  Addr(Return Value)
*
WOLA_CLIENT_INFO_PARMS DSECT ,
WOLA_CLIENT_INFO_REGNAME      DS AD in  +000  Addr(Register name)
WOLA_CLIENT_INFO_WOLAGRP      DS AD out +008  Addr(WOLA group name)
WOLA_CLIENT_INFO_WOLA2        DS AD out +010  Addr(WOLA name part 2)
WOLA_CLIENT_INFO_WOLA3        DS AD out +018  Addr(WOLA name part 3)
WOLA_CLIENT_INFO_CONNDATA     DS AD out +020  Addr(BBOACONN)
WOLA_CLIENT_INFO_CICSPRM      DS AD in  +028  Addr(CICS parms)
WOLA_CLIENT_INFO_RC           DS AD out +030  Addr(Return Code)
WOLA_CLIENT_INFO_RSN          DS AD out +038  Addr(Reason Code)
*
WOLA_CLIENT_GETCTX_PARMS DSECT ,
WOLA_CLIENT_GETCTX_HANDLE     DS AD in  +000  Addr(Connection hdl)
WOLA_CLIENT_GETCTX_DATA       DS AD in  +008  Addr(Context data)
WOLA_CLIENT_GETCTX_DATAL      DS AD in  +010  Addr(Context length)
WOLA_CLIENT_GETCTX_CICSPRM    DS AD in  +018  Addr(CICS parms)
WOLA_CLIENT_GETCTX_RC         DS AD out +020  Addr(Return Code)
WOLA_CLIENT_GETCTX_RSN        DS AD out +028  Addr(Reason Code)
WOLA_CLIENT_GETCTX_RV         DS AD out +030  Addr(Return Value)
*
* Return codes / Reason codes
BBOAAPI_RC_ERROR8 EQU 8
BBOAAPI_RC_SEVERE12 EQU 12
BBOAAPI_RSN_BADBGVT EQU 10
BBOAAPI_RSN_NO_BCBA EQU 86
BBOAAPI_RSN_NO_AMCST EQU 88
BBOAAPI_RSN_NO_AMCSS EQU 90
BBOAAPI_RSN_IMS_PREINIT EQU 96

* This RSN is used by client_wola_stubs.mc to tell us to call the tWAS
* stub instead.
WOLA_RSN_INTERNAL_TRY_TWAS_STUB EQU 512

          MEND  ,
*
