*/****START OF SPECIFICATIONS*****************************************/
*/*                                                                  */
*/*01* Macro Name: BBOACLNK                                          */
*/*                                                                  */
*/*01* Descriptive Name: Adapters CICS TRUE Link task parm list      */
*/*                                                                  */
*/*02*  Acronym:                                                     */
*/*                                                                  */
*/*01* PROPRIETARY STATEMENT=                                        */
*/*                                                                  */
*/*********************************************************************
* IBM Confidential
* OCO Source Materials
* 5655-N02 Copyright IBM Corp. 2009
* The source code for this program is not published or otherwise
* divested of its trade secrets, irrespective of what has been
* deposited with the U.S. Copyright Office.
* Status = H28W700
**********************************************************************/
*/*                                                                  */
*/*01* COMPONENT: boss                                               */
*/*                                                                  */
*/*01* DSECT Name: BBOACLNK                                          */
*/*                                                                  */
*/*01* Eye-Catcher: none                                             */
*/*02*  Offset:                                                      */
*/*02*  Length:                                                      */
*/*                                                                  */
*/*01* Storage Attributes:                                           */
*/*02*  dynamic area                                                 */
*/*                                                                  */
*/*02*  Key: callers key                                             */
*/*02*  Residency: Any                                               */
*/*02*  Main Storage: YES                                            */
*/*02*  Auxiliary Storage: n/a                                       */
*/*02*  Virtual Storage: n/a                                         */
*/*                                                                  */
*/*01* Size: See assembler listing.                                  */
*/*                                                                  */
*/*01* Created by: WAS CICS link server                              */
*/*                                                                  */
*/*01* Pointed to by: Passed into link task parameter list           */
*/*                                                                  */
*/*01* Serialization: none                                           */
*/*                                                                  */
*/*01* Function: This macro maps the link task parameter list for    */
*/*              our TRUE routine BBOATRUE.                          */
*/*                                                                  */
*/*02*                                                               */
*/*                                                                  */
*/*01* Method of Access:                                             */
*/*                                                                  */
*/*02*  ASM: n/a                                                     */
*/*                                                                  */
*/*02*  PL/X: ?Asaadmac Name(BBOACLNK) Listopt(Yes) Class            */
*/*                                                                  */
*/*01* Notes:                                                        */
*/*                                                                  */
*/*02*  Dependencies:                                                */
*/*                                                                  */
*/*01* Distribution Library:                                         */
*/*                                                                  */
*/* EXTERNAL CLASSIFICATION: NONE                                    */
*/* END OF EXTERNAL CLASSIFICATION                                   */
*/*                                                                  */
*/*01* Change Activity:                                              */
*/*                                                                  */
*/*   $F003691      H28W700 20091116 PDFG: Converted from C          */
*/*   $F003691      H28W700 20100212 PDFG: Link task recovery work   */
*/*   $F003691      H28W700 20100225 PDFG: Add DGN/NDN/SVN           */
*/*   $711599       H28W700 20110720 JTM : CICS TS 4.2/WOLA WAS/CICS */
*/*                                        correlator                */
*/*                                                                  */
*/****END OF SPECIFICATIONS*******************************************/
*/*
         MACRO
         BBOACLNK  ,
*
* The following control block (BBOACLNK) is used in
* bboatrue.asm:
*
* Note: keep the assembler, plx and C mappings in sync (C mapping
*       is in bboashr.h)
*
*BBOACLNK DSECT
ACLNKEYE              DS CL8
ACLNKVER              DS H
ACLNKSIZ              DS H
ACLNKFLAGS            DS 1F
ACLNK_TASKNUM         DS CL8
ACLNK_REGNAME         DS CL12
ACLNK_CONNHDL         DS CL12
ACLNK_SERVNAME        DS CL8
ACLNK_REQCONTAINERID  DS CL16
ACLNK_REQCONTAINERTYPE DS F
ACLNK_RSPCONTAINERID  DS CL16
ACLNK_RSPCONTAINERTYPE DS F
ACLNK_REQDATALEN      DS F
ACLNK_TRACELVL        DS F
ACLNK_TRACETDQ        DS CL4
ACLNK_BBOC_SVCNAME    DS CL8
ACLNK_RSVD1           DS CL16
ACLNK_TX_FORMATID     DS F
ACLNK_TX_TIDLEN       DS F
ACLNK_TX_BQUALLEN     DS F
ACLNK_TX_TID          DS CL128
ACLNK_TX_URID         DS CL16
ACLNK_TX_URTOK        DS CL16
ACLNK_TX_FLAGS        DS F
ACLNK_CONN_SVR        DS CL27
ACLNK_RSVD2           DS CL5
ACLNK_REUC            DS F
ACLNK_REUT            DS F
ACLNK_CORR_ID         DS CL64                      @711599A
ACLNK_CORR_DATA1      DS CL64                      @711599A
ACLNK_CORR_DATA2      DS CL64                      @711599A
ACLNK_CORR_DATA3      DS CL64                      @711599A
BBOACLNK_SIZ          EQU (*-ACLNKEYE)
          MEND
**/
*Declare
*  1 BBOACLNK  Bdy(Word) Based,    /*     Task work area for TRUE  */
*    3 aclnkeye          Char(8),
*    3 aclnkver          Fixed(16),
*    3 aclnksiz          Fixed(16),
*    3 aclnkflags        Fixed(32),
*      5 *               Bit(26),
*      5 aclnkflg_reuse  Bit(1),
*      5 aclnkflg_commarea Bit(1),
*      5 aclnkflg_container Bit(1),
*      5 aclnkflg_W2Csec Bit(1),
*      5 aclnkflg_tx     Bit(1),
*      5 aclnkflg_globaltx Bit(1),
*    3 aclnk_tasknum     Char(8),
*    3 aclnk_regname     Char(12),
*    3 aclnk_connhdl     Char(12),
*    3 aclnk_servname    Char(8),
*    3 aclnk_reqcontainerid Char(16),
*    3 aclnk_reqcontainertype Fixed(31),
*    3 aclnk_rspcontainerid Char(16),
*    3 aclnk_rspcontainertype Fixed(31),
*    3 aclnk_reqdatalen  Fixed(32),
*    3 aclnk_tracelvl    Fixed(31),
*    3 aclnk_tracetdq    Char(4),
*    3 aclnk_bboc_svcname Char(8),
*    3 aclnk_rsvd1       Char(16),
*    3 aclnk_tx_data,
*      5 aclnk_tx_formatid Fixed(31),
*      5 aclnk_tx_tidlen Fixed(31),
*      5 aclnk_tx_bquallen Fixed(31),
*      5 aclnk_tx_tid    Char(128),
*      5 aclnk_tx_urid   Char(16),
*      5 aclnk_tx_urtok  Char(16),
*      5 aclnk_tx_flags  Fixed(32),
*        7 *             Bit(26),
*        7 aclnkflg_tx_tidlist Bit(1),                   /* @F003691A*/
*        7 aclnkflg_tx_rec Bit(1),                       /* @F003691A*/
*        7 aclnkflg_tx_inactive Bit(1),
*        7 aclnkflg_tx_prepare Bit(1),
*        7 aclnkflg_tx_commit Bit(1),
*        7 aclnkflg_tx_backout Bit(1),
*    3 aclnk_conn_svr    Char(27),                       /* @F003691A*/
*    3 aclnk_rsvd2       Char(5),                        /* @F003691A*/
*    3 aclnk_reuc        Fixed(31),                      /* @711599A*/
*    3 aclnk_reut        Fixed(31),                      /* @711599A*/
*    3 aclnk_corr_id     Char(64),                       /* @711599A*/
*    3 aclnk_corr_data1  Char(64),                       /* @711599A*/
*    3 aclnk_corr_data2  Char(64),                       /* @711599A*/
*    3 aclnk_corr_data3  Char(64);                       /* @711599A*/

