*                                                                              
* IBM Confidential                                                             
*                                                                              
* OCO Source Materials                                                         
*                                                                              
* Copyright IBM Corp. 2014                                                   
*                                                                              
* The source code for this program is not published or otherwise               
* divested of its trade secrets, irrespective of what has been                 
* deposited with the U.S. Copyright Office.                                    
*                                                                              
         MACRO                                                                 
&NAME    BBOAMCST                                                              
         GBLB  &BBOAMCST_DEFINE                                                
         GBLC  &BBOAMCST_NAM                                                   
         GBLC  &CCN_CSECT                                                      
         AIF (&BBOAMCST_DEFINE).NODSECT                                        
&BBOAMCST_DEFINE SETB 1                                                        
* --------------------------------------------------------------------- -------
* Keep the struct of Master Client Stub Table same as tWAS                     
* where to say it is DWORD boundary  DS 0D ?                                   
* --------------------------------------------------------------------- -------
BBOAMCST DSECT         DSECT    Mapping of temporary dynamic area              
AMCST_EYE              DS CL8   Eye catcher 'BBOAMCST'                         
AMCST_VER              DS H     Version                                        
AMCST_FLAGS            DS H     Flags                                          
AMCST_NUM_SLOTS        DS H     Number of slots                                
AMCST_FILLER1          DS H     Filler1                                        
AMCST_DEAD_SLOTS       DS A     Old Copies of BBOAMCSS                         
AMCST_FILLER2          DS CL32  Filler2                                        
AMCST_SLOTS            DS A     Pointer to Slots                               

BBOAMCSS DSECT         DSECT    Mapping of temporary dynamic area              
AMCSS_EYE              DS CL8   Eye catcher 'BBOAMCSS'                         
AMCSS_SLOT_NUM         DS H     Slot number occupied                            
AMCSS_SLOT_VER         DS H     Version of slot
AMCSS_VER              DS H     Version of the struct
AMCSS_FILLER1          DS CL10  Filler1
AMCSS_DEAD_STCK        DS CL8   Time placed on dead q
AMCSS_DEAD_NEXT        DS A     Next entry on dead q
AMCSS_CODE_LEN         DS F     Length of BBOACALL
AMCSS_CODE_PTR         DS A     Pointer to BBOACALL
AMCSS_VECTOR_PTR       DS A     Pointer to the vector
             
*                                                                              
* Eye catcher string                                                           
*                                                                              
&BBOAMCST_NAM SETC 'BBOAMCST'                                                  
&CCN_CSECT CSECT                                                               
.NODSECT ANOP                                                               
         MEND                                                                  
