*                                                                              
* IBM Confidential                                                             
*                                                                              
* OCO Source Materials                                                         
*                                                                              
* Copyright IBM Corp. 2014                                                     
*                                                                              
* The source code for this program is not published or otherwise               
* divested of its trade secrets, irrespective of what has been                 
* deposited with the U.S. Copyright Office.
*                                    
* -------------------------------------------------------------------
*
* The following control block (BBOACTAA) is used in bboatrue.cicsasm.
* It is mapped by the UEPTAA field.  CICS passes us the same UEPTAA 
* address for each request made on this task, so the control block 
* can be used to store information from one invocation to the next.
*
* The remaining unmapped part of the control block is used as dynamic
* area for called routines.  The NAB in the RSA is set to indicate
* where this is.  Since there is a NAB, the save area is 80 bytes
* rather than 72.
*
* Note that this BBOACTAA is mapped differently than the one used by
* tWAS.
*
BBOACTAA DSECT
BBOACTAA_RSA          DS CL80  0x000 Save area for called routines.
BBOACTAA_EYE          DS CL8   0x050 Eye catcher 'BBOACTAA'
BBOACTAA_VER          DS H     0x058 Version
BBOACTAA_LEN          DS H     0x05A Length of mapped portion
BBOACTAA_FLG          DS CL1   0x05C Flags
                      DS 0F
BBOACTAA_PCNUM_TWAS   DS F     0x060 PC # to use for calling tWAS PC1
BBOACTAA_AVAILABLE    DS CL412 0x064 Available to grow mapped portion
*
BBOACTAA_VERSION_1           EQU 1
BBOACTAA_MAPPED_LEN          EQU *-BBOACTAA_RSA
BBOACTAA_FLG_SYNCP_MASK      EQU 1
BBOACTAA_FLG_SYNCP_NOPC_MASK EQU 2
BBOACTAA_FLG_NO_SYNCP_MASK   EQU 4
*